HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_regdef.h
/** \\brief  DMA Channel Control Register */
typedef struct _Ifx_DMA_BLK_CH_CHCR_Bits
{
    unsigned int TREL:14;                   /**< \brief [13:0] Transfer Reload Value (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BLKM:3;                    /**< \brief [18:16] Block Mode (rw) */
    unsigned int RROAT:1;                   /**< \brief [19:19] Reset Request Only After Transaction (rw) */
    unsigned int CHMODE:1;                  /**< \brief [20:20] Channel Operation Mode (rw) */
    unsigned int CHDW:2;                    /**< \brief [22:21] Channel Data Width (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int PATSEL:2;                  /**< \brief [25:24] Pattern Select (rw) */
    unsigned int ECH:1;                     /**< \brief [26:26] Enable Hardware Transfer Request (w) */
    unsigned int DCH:1;                     /**< \brief [27:27] Disable Hardware Transfer Request (w) */
    unsigned int PRSEL:1;                   /**< \brief [28:28] Peripheral Request Select (rw) */
    unsigned int SCH:1;                     /**< \brief [29:29] Set Transaction Request for DMA Channel z (w) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CH_CHCR_Bits;

/** \\brief  DMA Channel Interrupt Control Register */
typedef struct _Ifx_DMA_BLK_CH_CHICR_Bits
{
    unsigned int WRPSE:1;                   /**< \brief [0:0] Wrap Source Enable (rw) */
    unsigned int WRPDE:1;                   /**< \brief [1:1] Wrap Destination Enable (rw) */
    unsigned int INTCT:2;                   /**< \brief [3:2] Interrupt Control (rw) */
    unsigned int ETRL:1;                    /**< \brief [4:4] Enable Transaction Request Lost Interrupt (rw) */
    unsigned int reserved_5:7;              /**< \brief \internal Reserved */
    unsigned int IRDV:4;                    /**< \brief [15:12] Interrupt Raise Detect Value (rw) */
    unsigned int CWRP:1;                    /**< \brief [16:16] Clear Wrap Buffer Interrupt xz (w) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int CICH:1;                    /**< \brief [18:18] Clear Interrupt for DMA Channel xz (w) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int CTL:1;                     /**< \brief [20:20] Clear Transaction Request Lost for DMA Channel xz (w) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CH_CHICR_Bits;

/** \\brief  DMA Channel Status Register */
typedef struct _Ifx_DMA_BLK_CH_CHSR_Bits
{
    unsigned int TCOUNT:14;                 /**< \brief [13:0] Transfer Count Status (rh) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int LXO:1;                     /**< \brief [15:15] Old Value of Pattern Detection (rh) */
    unsigned int WRPS:1;                    /**< \brief [16:16] Wrap Source Buffer (rh) */
    unsigned int WRPD:1;                    /**< \brief [17:17] Wrap Destination Buffer (rh) */
    unsigned int ICH:1;                     /**< \brief [18:18] Interrupt from Channel (rh) */
    unsigned int IPM:1;                     /**< \brief [19:19] Pattern Detection from Channel (rh) */
    unsigned int TRL:1;                     /**< \brief [20:20] Transaction/Transfer Request Lost of DMA Channel (rh) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int CH:1;                      /**< \brief [24:24] Transaction Request State (rh) */
    unsigned int HTRE:1;                    /**< \brief [25:25] Hardware Transaction Request Enable State (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CH_CHSR_Bits;

/** \\brief  DMA Channel Destination Address Register */
typedef struct _Ifx_DMA_BLK_CH_DADR_Bits
{
    unsigned int DADR:32;                   /**< \brief [31:0] Destination Address (rwh) */
} Ifx_DMA_BLK_CH_DADR_Bits;

/** \\brief  DMA Channel Source Address Register */
typedef struct _Ifx_DMA_BLK_CH_SADR_Bits
{
    unsigned int SADR:32;                   /**< \brief [31:0] Source Start Address (rwh) */
} Ifx_DMA_BLK_CH_SADR_Bits;

/** \\brief  DMA Channel Shadow Address Register */
typedef struct _Ifx_DMA_BLK_CH_SHADR_Bits
{
    unsigned int SHADR:32;                  /**< \brief [31:0] Shadowed Address (rwh) */
} Ifx_DMA_BLK_CH_SHADR_Bits;

/** \\brief  DMA Channel Interrupt Set Register0 */
typedef struct _Ifx_DMA_BLK_CHINTR0_Bits
{
    unsigned int SIT0:1;                    /**< \brief [0:0] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT1:1;                    /**< \brief [1:1] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT2:1;                    /**< \brief [2:2] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT3:1;                    /**< \brief [3:3] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT4:1;                    /**< \brief [4:4] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT5:1;                    /**< \brief [5:5] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT6:1;                    /**< \brief [6:6] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT7:1;                    /**< \brief [7:7] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT8:1;                    /**< \brief [8:8] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT9:1;                    /**< \brief [9:9] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT10:1;                   /**< \brief [10:10] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT11:1;                   /**< \brief [11:11] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT12:1;                   /**< \brief [12:12] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT13:1;                   /**< \brief [13:13] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT14:1;                   /**< \brief [14:14] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT15:1;                   /**< \brief [15:15] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT16:1;                   /**< \brief [16:16] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT17:1;                   /**< \brief [17:17] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT18:1;                   /**< \brief [18:18] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT19:1;                   /**< \brief [19:19] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT20:1;                   /**< \brief [20:20] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT21:1;                   /**< \brief [21:21] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT22:1;                   /**< \brief [22:22] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int SIT23:1;                   /**< \brief [23:23] Set Interrupt Trigger for DMA Channel z (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CHINTR0_Bits;

/** \\brief  DMA Channel Reset Request Register0 */
typedef struct _Ifx_DMA_BLK_CHRSTR0_Bits
{
    unsigned int CH0:1;                     /**< \brief [0:0] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH1:1;                     /**< \brief [1:1] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH2:1;                     /**< \brief [2:2] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH3:1;                     /**< \brief [3:3] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH4:1;                     /**< \brief [4:4] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH5:1;                     /**< \brief [5:5] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH6:1;                     /**< \brief [6:6] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH7:1;                     /**< \brief [7:7] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH8:1;                     /**< \brief [8:8] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH9:1;                     /**< \brief [9:9] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH10:1;                    /**< \brief [10:10] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH11:1;                    /**< \brief [11:11] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH12:1;                    /**< \brief [12:12] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH13:1;                    /**< \brief [13:13] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH14:1;                    /**< \brief [14:14] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH15:1;                    /**< \brief [15:15] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH16:1;                    /**< \brief [16:16] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH17:1;                    /**< \brief [17:17] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH18:1;                    /**< \brief [18:18] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH19:1;                    /**< \brief [19:19] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH20:1;                    /**< \brief [20:20] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH21:1;                    /**< \brief [21:21] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH22:1;                    /**< \brief [22:22] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH23:1;                    /**< \brief [23:23] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CHRSTR0_Bits;

/** \\brief  DMA Clear Error Register */
typedef struct _Ifx_DMA_BLK_CLRE_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int CMExSER:1;                 /**< \brief [16:16] Clear Move Engine x Source Error (w) */
    unsigned int CMExDER:1;                 /**< \brief [17:17] Clear Move Engine x Destination Error (w) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int CFPIER:1;                  /**< \brief [20:20] Clear FPI Error (w) */
    unsigned int CSRIER:1;                  /**< \brief [21:21] Clear SRI Error (w) */
    unsigned int CPERER:1;                  /**< \brief [22:22] Clear Peripheral Error (w) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CLRE_Bits;

/** \\brief  DMA Enable Error Register */
typedef struct _Ifx_DMA_BLK_EER_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int ESER:1;                    /**< \brief [16:16] Enable Move Engine x Source Error (rw) */
    unsigned int EDER:1;                    /**< \brief [17:17] Enable Move Engine x Destination Error (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_DMA_BLK_EER_Bits;

/** \\brief  DMA Error Status Register */
typedef struct _Ifx_DMA_BLK_ERRSR_Bits
{
    unsigned int LEC:6;                     /**< \brief [5:0] Move Engine x Last Error Channel (rh) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int SER:1;                     /**< \brief [16:16] Move Engine x Source Error (rh) */
    unsigned int DER:1;                     /**< \brief [17:17] Move Engine x Destination Error (rh) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int FPIER:1;                   /**< \brief [20:20] Move Engine x FPI Bus Error (rh) */
    unsigned int SRIER:1;                   /**< \brief [21:21] Move Engine x SRI Bus Error (rh) */
    unsigned int PERER:1;                   /**< \brief [22:22] Move Engine x Peripheral Error (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ERRSR_Bits;

/** \\brief  DMA Move Engine Interrupt Set Register */
typedef struct _Ifx_DMA_BLK_ME_INTR_Bits
{
    unsigned int SIT:1;                     /**< \brief [0:0] Set Interrupt Trigger for DMA Move Engine x (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ME_INTR_Bits;

/** \\brief  DMA Move Engine Pattern Read Register */
typedef struct _Ifx_DMA_BLK_ME_PR_Bits
{
    unsigned int PAT00:8;                   /**< \brief [7:0] Pattern for Move Engine x (rw) */
    unsigned int PAT01:8;                   /**< \brief [15:8] Pattern for Move Engine x (rw) */
    unsigned int PAT02:8;                   /**< \brief [23:16] Pattern for Move Engine x (rw) */
    unsigned int PAT03:8;                   /**< \brief [31:24] Pattern for Move Engine x (rw) */
} Ifx_DMA_BLK_ME_PR_Bits;

