HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_regdef.h
/** \\brief  DMA Move Engine Read Register */
typedef struct _Ifx_DMA_BLK_ME_R_Bits
{
    unsigned int RD00:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD01:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD02:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD03:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R_Bits;

/** \\brief  DMA Move Engine Status Register */
typedef struct _Ifx_DMA_BLK_ME_SR_Bits
{
    unsigned int RS:1;                      /**< \brief [0:0] Move Engine x Read Status (rh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int WS:1;                      /**< \brief [4:4] Move Engine x Write Status (rh) */
    unsigned int reserved_5:11;             /**< \brief \internal Reserved */
    unsigned int CH:6;                      /**< \brief [21:16] Reading Channel in Move Engine x (rh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ME_SR_Bits;

/** \\brief  DMA Suspend Acknowledge Register0 */
typedef struct _Ifx_DMA_BLK_SUSACR0_Bits
{
    unsigned int SUSAC0:1;                  /**< \brief [0:0] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC1:1;                  /**< \brief [1:1] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC2:1;                  /**< \brief [2:2] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC3:1;                  /**< \brief [3:3] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC4:1;                  /**< \brief [4:4] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC5:1;                  /**< \brief [5:5] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC6:1;                  /**< \brief [6:6] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC7:1;                  /**< \brief [7:7] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC8:1;                  /**< \brief [8:8] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC9:1;                  /**< \brief [9:9] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC10:1;                 /**< \brief [10:10] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC11:1;                 /**< \brief [11:11] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC12:1;                 /**< \brief [12:12] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC13:1;                 /**< \brief [13:13] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC14:1;                 /**< \brief [14:14] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC15:1;                 /**< \brief [15:15] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC16:1;                 /**< \brief [16:16] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC17:1;                 /**< \brief [17:17] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC18:1;                 /**< \brief [18:18] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC19:1;                 /**< \brief [19:19] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC20:1;                 /**< \brief [20:20] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC21:1;                 /**< \brief [21:21] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC22:1;                 /**< \brief [22:22] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC23:1;                 /**< \brief [23:23] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_SUSACR0_Bits;

/** \\brief  DMA Suspend Enable Register0 */
typedef struct _Ifx_DMA_BLK_SUSENR0_Bits
{
    unsigned int SUSEN0:1;                  /**< \brief [0:0] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN1:1;                  /**< \brief [1:1] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN2:1;                  /**< \brief [2:2] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN3:1;                  /**< \brief [3:3] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN4:1;                  /**< \brief [4:4] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN5:1;                  /**< \brief [5:5] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN6:1;                  /**< \brief [6:6] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN7:1;                  /**< \brief [7:7] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN8:1;                  /**< \brief [8:8] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN9:1;                  /**< \brief [9:9] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN10:1;                 /**< \brief [10:10] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN11:1;                 /**< \brief [11:11] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN12:1;                 /**< \brief [12:12] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN13:1;                 /**< \brief [13:13] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN14:1;                 /**< \brief [14:14] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN15:1;                 /**< \brief [15:15] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN16:1;                 /**< \brief [16:16] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN17:1;                 /**< \brief [17:17] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN18:1;                 /**< \brief [18:18] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN19:1;                 /**< \brief [19:19] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN20:1;                 /**< \brief [20:20] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN21:1;                 /**< \brief [21:21] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN22:1;                 /**< \brief [22:22] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int SUSEN23:1;                 /**< \brief [23:23] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_SUSENR0_Bits;

/** \\brief  DMA Sub-block 0 Clock Control Register */
typedef struct _Ifx_DMA_CLC0_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_DMA_CLC0_Bits;

/** \\brief  DMA Sub-block 1 Clock Control Register */
typedef struct _Ifx_DMA_CLC1_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_DMA_CLC1_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_DMA_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DMA_ID_Bits;

/** \\brief  DMA OCDS Trigger Set Select */
typedef struct _Ifx_DMA_OTSS_Bits
{
    unsigned int TGS:4;                     /**< \brief [3:0] Trigger Set () for OTGB0/1 (rw) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int BS:1;                      /**< \brief [7:7] OTGB0/1 Bus Select (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_DMA_OTSS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_union
 * \{  */

/** \\brief  DMA Sub-block Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ACCEN0_Bits B;
} Ifx_DMA_BLK_ACCEN0;

/** \\brief  DMA Sub-block Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ACCEN1_Bits B;
} Ifx_DMA_BLK_ACCEN1;

/** \\brief  DMA Channel Address Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_ADRCR_Bits B;
} Ifx_DMA_BLK_CH_ADRCR;

