HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_regdef.h
/** \\brief  DMA Channel Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_CHCR_Bits B;
} Ifx_DMA_BLK_CH_CHCR;

/** \\brief  DMA Channel Interrupt Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_CHICR_Bits B;
} Ifx_DMA_BLK_CH_CHICR;

/** \\brief  DMA Channel Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_CHSR_Bits B;
} Ifx_DMA_BLK_CH_CHSR;

/** \\brief  DMA Channel Destination Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_DADR_Bits B;
} Ifx_DMA_BLK_CH_DADR;

/** \\brief  DMA Channel Source Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_SADR_Bits B;
} Ifx_DMA_BLK_CH_SADR;

/** \\brief  DMA Channel Shadow Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CH_SHADR_Bits B;
} Ifx_DMA_BLK_CH_SHADR;

/** \\brief  DMA Channel Interrupt Set Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CHINTR0_Bits B;
} Ifx_DMA_BLK_CHINTR0;

/** \\brief  DMA Channel Reset Request Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CHRSTR0_Bits B;
} Ifx_DMA_BLK_CHRSTR0;

/** \\brief  DMA Clear Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CLRE_Bits B;
} Ifx_DMA_BLK_CLRE;

/** \\brief  DMA Enable Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_EER_Bits B;
} Ifx_DMA_BLK_EER;

/** \\brief  DMA Error Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ERRSR_Bits B;
} Ifx_DMA_BLK_ERRSR;

/** \\brief  DMA Move Engine Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_INTR_Bits B;
} Ifx_DMA_BLK_ME_INTR;

/** \\brief  DMA Move Engine Pattern Read Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_PR_Bits B;
} Ifx_DMA_BLK_ME_PR;

/** \\brief  DMA Move Engine Read Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_R_Bits B;
} Ifx_DMA_BLK_ME_R;

/** \\brief  DMA Move Engine Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_SR_Bits B;
} Ifx_DMA_BLK_ME_SR;

/** \\brief  DMA Suspend Acknowledge Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_SUSACR0_Bits B;
} Ifx_DMA_BLK_SUSACR0;

/** \\brief  DMA Suspend Enable Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_SUSENR0_Bits B;
} Ifx_DMA_BLK_SUSENR0;

/** \\brief  DMA Sub-block 0 Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_CLC0_Bits B;
} Ifx_DMA_CLC0;

/** \\brief  DMA Sub-block 1 Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_CLC1_Bits B;
} Ifx_DMA_CLC1;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ID_Bits B;
} Ifx_DMA_ID;

/** \\brief  DMA OCDS Trigger Set Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_OTSS_Bits B;
} Ifx_DMA_OTSS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \\brief  DMA channels */
typedef volatile struct _Ifx_DMA_BLK_CH
{
    Ifx_DMA_BLK_CH_CHSR CHSR;               /**< \brief 0, DMA Channel Status Register */
    Ifx_DMA_BLK_CH_CHCR CHCR;               /**< \brief 4, DMA Channel Control Register */
    Ifx_DMA_BLK_CH_CHICR CHICR;             /**< \brief 8, DMA Channel Interrupt Control Register */
    Ifx_DMA_BLK_CH_ADRCR ADRCR;             /**< \brief C, DMA Channel Address Control Register */
    Ifx_DMA_BLK_CH_SADR SADR;               /**< \brief 10, DMA Channel Source Address Register */
    Ifx_DMA_BLK_CH_DADR DADR;               /**< \brief 14, DMA Channel Destination Address Register */
    Ifx_DMA_BLK_CH_SHADR SHADR;             /**< \brief 18, DMA Channel Shadow Address Register */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
} Ifx_DMA_BLK_CH;

/** \\brief  DMA move engine */
typedef volatile struct _Ifx_DMA_BLK_ME
{
    Ifx_DMA_BLK_ME_SR SR;                   /**< \brief 0, DMA Move Engine Status Register */
    Ifx_DMA_BLK_ME_R R;                     /**< \brief 4, DMA Move Engine Read Register */
    Ifx_DMA_BLK_ME_INTR INTR;               /**< \brief 8, DMA Move Engine Interrupt Set Register */
    Ifx_DMA_BLK_ME_PR PR;                   /**< \brief C, DMA Move Engine Pattern Read Register */
} Ifx_DMA_BLK_ME;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

