HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_regdef.h
/** \\brief  DMA sub block */
typedef volatile struct _Ifx_DMA_BLK
{
    Ifx_DMA_BLK_EER EER;                    /**< \brief 0, DMA Enable Error Register */
    Ifx_DMA_BLK_ERRSR ERRSR;                /**< \brief 4, DMA Error Status Register */
    Ifx_DMA_BLK_CLRE CLRE;                  /**< \brief 8, DMA Clear Error Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_DMA_BLK_ME ME;                      /**< \brief 10, DMA move engine */
    Ifx_DMA_BLK_CHRSTR0 CHRSTR0;            /**< \brief 20, DMA Channel Reset Request Register0 */
    unsigned char reserved_24[28];          /**< \brief 24, \internal Reserved */
    Ifx_DMA_BLK_SUSENR0 SUSENR0;            /**< \brief 40, DMA Suspend Enable Register0 */
    unsigned char reserved_44[4];           /**< \brief 44, \internal Reserved */
    Ifx_DMA_BLK_SUSACR0 SUSACR0;            /**< \brief 48, DMA Suspend Acknowledge Register0 */
    unsigned char reserved_4C[4];           /**< \brief 4C, \internal Reserved */
    Ifx_DMA_BLK_CHINTR0 CHINTR0;            /**< \brief 50, DMA Channel Interrupt Set Register0 */
    unsigned char reserved_54[12];          /**< \brief 54, \internal Reserved */
    Ifx_DMA_BLK_CH CH[24];                  /**< \brief 60, DMA channels */
    unsigned char reserved_360[1400];       /**< \brief 360, \internal Reserved */
    Ifx_DMA_BLK_ACCEN1 ACCEN1;              /**< \brief 8D8, DMA Sub-block Access Enable Register 1 */
    Ifx_DMA_BLK_ACCEN0 ACCEN0;              /**< \brief 8DC, DMA Sub-block Access Enable Register 0 */
} Ifx_DMA_BLK;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  DMA object */
typedef volatile struct _Ifx_DMA
{
    Ifx_DMA_CLC0 CLC0;                      /**< \brief 0, DMA Sub-block 0 Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_DMA_ID ID;                          /**< \brief 8, Module Identification Register */
    Ifx_DMA_OTSS OTSS;                      /**< \brief C, DMA OCDS Trigger Set Select */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
    Ifx_DMA_BLK BLK0;                       /**< \brief 20, DMA sub block 0 */
    unsigned char reserved_900[1792];       /**< \brief 900, \internal Reserved */
    Ifx_DMA_CLC1 CLC1;                      /**< \brief 1000, DMA Sub-block 1 Clock Control Register */
    unsigned char reserved_1004[28];        /**< \brief 1004, \internal Reserved */
    Ifx_DMA_BLK BLK1;                       /**< \brief 1020, DMA sub block 1 */
    unsigned char reserved_1900[5888];      /**< \brief 1900, \internal Reserved */
} Ifx_DMA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REGDEF_H */
